{
    "Browser-Games":
    [
      {
        "Name": "Battle of the Heart",
        "Creation Date": "August 4th 2023",
        "Description": "A Student Bullet Hell/Dating Sim Game I made in USC's Foundations in game design class",
        "player-link": "https://itch.io/embed-upload/8441734?color=333333",
		"button-link": "https://itch.io/embed/2174206?border_width=3",
		"Commentary": "This one was made during my time at USC’s “Foundations in Game Design” class. Where you have to create a game with a team of 3-4 people in the span of 6 weeks. If you have the time and/or the money I strongly recommend you do if you want to get into game development. Really helped me get the fundamentals of game design down and a lot of what I learned I still use to this day. <br><br>The concept of the game came from my classmate and one of my team partners, Liberty Fritz. Who basically had a concept for a fighting game where the player has to progress by romancing the enemies like that of a dating sim. The fighting game eventually turned into Bullet Hell and eventually my teammate Justin Walker came up with the name Battle of the Heart. Because you were battling enemies with your heart. I eventually came up with the western theme for no real apparent reason. I just liked the aesthetic and wanted to make something with it.<br><br>We divided the work by having Alex Lai do the concept art and high resolution pictures and backgrounds. Liberty does the sprites. Justin does level design, sound, boss planning, and the writing for the “Gambler” level. And I did the Programming and writing for the “Gunslinger” and “ghost” levels. <br><br>Development of the game was honestly as delightful and fun as it was long and frustrating. Being the only one in the class that knew Unity beforehand likely caused some of the stress I was feeling. Not only because I was the one who had to take all the assets my teammates were making and actually make them work in game, but also because I often got distracted from my work to answer the questions my other classmates had on how to use Unity. So much so that one of my professors, Ed Zobrist (Who I still keep in contact with on Linkedin) called me the “CTO of the class” in an honor I still hold dearly. <br><br> Writing the story for this game was a hell of a lot of fun. As I said before I wrote the first and last levels of our three levels, “Ghost” and “Gunslinger”. Both characters I came up with after watching “No Good Country for Old Men” after the game’s first playtest. I saw the remorseless psychopathy of Anton Chigyur and felt inspired to create a similarly emotionless killer in the form of Ghost. With Gunslinger being the Llewlyn Moss to Ghost’s Anton. A hopeless man on the run after making the mistake of crossing Ghost. As the game went on in development we had the idea of Ghost, but we still didn’t know who they even were. We kept it mysterious at the beginning of the game not only because we felt it would make them scarier, but also because we simply didn’t know what to do. But eventually in the last week of development I finally figured out who Ghost was. I chose to make her an immortal being because personally the idea of immortality freaks me the fuck out. Like the idea of living forever to the point of becoming bored of your own existence scares the shit out of me. Probably because humans have a hard time conceiving of something that just doesn’t end. From that I wanted to think about what would living that long do to a person. What would 1000 years of life do to a person’s mind? So I wrote her with a nihilistic attitude of someone who doesn’t care about life anymore. <br><br>I gained inspiration for a lot of her lines from a guy I used to work with on my robotics team who we’ll call Ben. Ben was a nihilistic ass. He was mean to just about anyone to the point it became a running joke on the team that Ben was just mean. He hated everyone but he hated me the most, I always tried to be nice and positive around him but the more I was positive the more it seemed he wanted me to off myself. He was someone who was just hopelessly realistic, unable to find any joy in life because he had to be “right” all the time. Granted he usually was correct in his assessments, but what do you get for being “right”. Depression, that’s what you get.<br><br>So I view a lot of the dialogue between Ghost and Leah as a discussion between that side. A debate between optimistic absurdism and hopeless nihilism. Leah knows that life is meaningless and instead of being discouraged, she sees it as more reason to do better. I thought Ghost was a good opponent for Leah because she is the exact opposite of Leah. Making befriending Ghost the ultimate challenge.<br><br>I also wrote Ghost as fairly trans-coded on purpose because a lot of ghosts' feelings were honestly beliefs I shared earlier in my transition and even more so before I found out I was trans. So in a way it was almost a sort of discussion with my old self along with a discussion with Ben. Also I chose it because everything I make has to be at least a little gay, obviously.<br><br>Although the game is pretty small and needs some more polishing I’m honestly quite proud of what we made in six weeks and I’m looking forward to doing more projects like this. I honestly am probably going to go back to this game and rework parts of this to function better. Hopefully over winter break I’ll finally have time with college apps being done.<br><br> Also If you wanna read the scripts we have the dialogue trees and cutscenes laid out on a figma board you can read <a style='' href='https://www.figma.com/file/AfsVyyGnKgn7rIQ5k6S6uM/Story?type=whiteboard&node-id=0%3A1&t=a9OjbC425n2P7EGx-1'>here</a>"
      },
      {
        "Name": "Dino Game Twist",
        "Creation Date": "November 12th 2022",
        "Description": "The Classic browser game, with a 3D twist and a few new mechanics. Made for fun by me",
        "player-link": "https://itch.io/embed-upload/6124694?color=333333",
		"button-link": "https://itch.io/embed/1609804?border_width=3",
		"Commentary": "Dino Game Twist is a game that rose from the ashes of another. If you read my project question essay you’ll know of the disastrous attempted game, SuperPortalGunPlus. In short, it wasn’t a success and eventually I moved on to another project. That project was Dino Game Twist. My very first game on Unity. It’s pretty simple, it’s Dino Game… but with a few twists. Like literally you have to twist the camera to keep moving. Essentially you jump over obstacles like cacti from the original game but also dodge meteors and once again turn the camera. Like I said, it’s very simple, the goal is just to get the highest score. I spent most of July and August working on this project and it came out pretty nicely. I shared it with some friends and ultimately I got the highest score because I’m the greatest at this game I made up. Although it came out nice, I tried doing a lot more with it. At one point I think I added special meteors that led to portals that led to a 3D Super Mario like boss battle where you fought against various weird things from the internet like your ISP or a crypto bro. But I never got to finish it as school started up and subsequently took up most of my time. I have recently wanted to go back and finish it but unfortunately after accidentally bricking my PC a few months ago and having to reinstall windows I lost the source code after forgetting to back it up. And since it’s a WebGL game it can’t be decompiled so if I ever go back I’ll have to work from scratch"
      }
    ],
    "Demos":
    [
      {
        "Name": "Better Kill Saul",
        "Creation Date": "March 27th 2023",
        "Description": "An FPS Movement Shooter demo with better call saul characters as enemies.",
        "player-link": "https://itch.io/embed-upload/7592240?color=333333",
		"button-link": "https://itch.io/embed/1988442?border_width=3",
		"Commentary": "I…Really don’t have a good explanation for the existence of this. I guess I just got bored and wanted to mess around with Unity’s pathfinding as a fun weekend project. I can’t really remember exactly why or how I made this other than it just being a fun joke. The only fun fact I have about it is that I remember I made it whilst watching the matrix. Honestly, despite the heavily stupid concept I actually had a lot of fun playing it. "
      },
      {
        "Name": "The Rug Defender",
        "Creation Date": "November 12th 2022",
        "Description": "The Classic browser game, with a 3D twist and a few new mechanics. Made for fun by me",
        "player-link": "https://itch.io/embed-upload/7371812?color=333333",
		"button-link": "https://itch.io/embed/1931726?border_width=3",
		"Commentary": "This one I can say quite a bit about despite it lacking so much substance. It was originally a demo I made to conceptualize something they were trying to do on the programming side of my robotics team. Then I realized that was really useless but the thing I made could be reworked into a fun thing for a game. So I looked for a game jam happening that weekend to find one that I could use it on. I found one where you had to incorporate this youtuber’s cat into it. The concept was essentially going to be a topdown bullet hell shooter where you’ve been shrunk down to the size of a bug and you have to take control of this roomba to “save” the cat from rodents by killing all the rodents. Until you find out that the rodents are harmless and the cat is just genocidal. I got a few friends together from a previous project but unfortunately nothing came of it due to me being too busy from schoolwork and whatnot. So now all I have is this demo to show for it, honestly I think one day before I graduate college I’ll probably finish it. I think it could have been really fun. Oh also you need a controller for this"
      }
    ],
    "Maps":
    [
      {
        "Name": "gm_black_creek_ave",
        "Creation Date": "April 30th 2023",
        "Description": "A Garry's Mod map rendention of my own neighborhood",
        "link": "https://steamcommunity.com/sharedfiles/filedetails/?id=2983779001",
		"Commentary-Type": "google-docs",
		"Commentary": "https://docs.google.com/document/d/e/2PACX-1vS5JbV5ng_LWtro63ApAezrgp8zn9vD78vJb0fawK7GlvNSKv9i4e6t8qZHgfj84mjsrpMC9QYy2Pex/pub?embedded=true",
		"Previews": 
		[
			
			{
				"Link": "data/images/1.jpg",
				"Type": "image"
			},

			{
				"Link": "data/images/2.jpg",
				"Type": "image"
			},

			{
				"Link": "data/images/3.jpg",
				"Type": "image"
			},

			{
				"Link": "data/images/4.jpg",
				"Type": "image"
			},

			{
				"Link": "data/images/5.jpg",
				"Type": "image"
			}
				
			
		]
      }
    ],
    "Videos":
    [
      {
        "Name": "G-Man has a Fun Fact",
        "Creation Date": "Februrary 4th 2021",
        "Description": "The first animation in Source 2 Filmaker I've ever made.",
        "link": "https://www.youtube.com/embed/8dw6sXIb8Oc?si=Y_7VFfuR_XXnNAK0",
		"Commentary": "Although this wasn’t my first 3D animation, it was the first I ever published. The first was also put together in Source 2 Filmmaker, but it was a lot simpler but also simultaneously really difficult for me. It was a very poor quality animation I made over the weekend of g-man jumping off a balcony after proclaiming to Gordon Freeman that he was going to, “Kermit Suicide”. Anyways, I only shared that one with friends, but then a couple days later I decided to try it again because I honestly had a lot of fun with it. Mind you this was still during covid when I had boundless amounts of time to dedicate to stupid projects. So for that entire week I decided to dedicate myself to that. Throughout that entire week I recorded the voiceover, did all the animations, etc and of course I published it on Friday of that week. It was <br><br> I had a fun time with it and there’s even a small joke in it that only I understand. You see at the very end of the animation, Alyx walks in with a crate. It’s a reference to the fact that when playing Half Life: Alyx (Which is a really good game, you should play it) I made the choice to carry a crate named… Crate with me throughout the game. No real reason why, I just thought it’d be funny. I’ll have you know that Crate unfortunately didn’t make it past the “Jeff” level. Not because he broke, but because I unfortunately couldn’t get it up a ladder I needed to progress. So I had to leave Crate behind. I hope he’s doing fine, and that he appreciates that I immortalized him in Source 2 Filmmaker."
      },
      {
        "Name": "[SFM] Scout Vibes to the iCarly Theme and dies",
        "Creation Date": "March 5th 2021",
        "Description": "The first animation in Source Filmaker I've ever made.",
        "link": "https://www.youtube.com/embed/ESIyqEqKkmE?si=lT79RHzf22y__T2p",
		"Commentary": "This is my second animation. The idea for this one came one Friday after online school. I don’t know why but for some reason I found out that regular Source Filmmaker has the feature of automatic lip-syncing and I was simultaneously feeling really nostalgic about iCarly. So I decided to try out the lip-syncing features with the iCarly theme song. This led to a week-long exploit of making it a whole animation based around Scout singing the iCarly theme. Also at some point along the way I decided that it’d be really funny if I sang the song so you can hear my voice in the background too. It was a fun project, good times."
      },
      {
        "Name": "(SFM) Top Hat and a Monacle",
        "Creation Date": "April 6th 2021",
        "Description": "The second animation in Source Filmaker I've ever made as a goof.",
        "link": "https://www.youtube.com/embed/gYznKWpMFW8?si=6Uc737fhxiG6jf6V",
		"Commentary": "This one was a short project. I was bored on a Monday and was watching some Videogamedunkey (specifically the “Ultimate Skyrim” video)  and I just thought, yeah, sure, let’s do it. So I got some models together on a half life map. The mudcrab model was pretty difficult to get since it’s not on the Source Filmmaker workshop. Instead I had to download the model from the Garry’s Mod workshop, decompile the .gma file and put the files in SFM. Fun little animation."
      },
      {
        "Name": "(S2FM) G-Man is Sims Cat Breakdancing",
        "Creation Date": "June 26th 2022",
        "Description": "Source 2 Filmaker animation I made as a little joke",
        "link": "https://www.youtube.com/embed/hsAaCcWX0JE?si=-8gfeAhJpxTFxOyP",
		"Commentary": "This was an example of me trying to ride a trend. Back in June of 2022 there was this meme of a cat from this obscure knockoff of The Sims just like doing this dance to this song called “Only you by intense” that was doing numbers. So I decided to hop on the trend and do a little bit extra to spice it up. It started as just the meme being recreated with G-Man and Gordon Freeman but eventually I felt that it’d be funnier if I added a little voice acting to it. <br><br> Fun fact when the guy spits out his cereal I actually was eating. I went into my garage to record it after rehearsing it a few times and in order to really get a good take of it I grabbed a handful of some homemade granola my mom had made, chewed and spat it out for the spit take. Sorry mom, it was the only thing we had adjacent to cereal in the house at the time, so I just took that. Unfortunately the granola died in vain as it didn’t take off with the trend quite as I hoped. But regardless I had some fun with it."
      },
      {
        "Name": "(SFM) You're a Dum Dum",
        "Creation Date": "November 12th 2022",
        "Description": "Animation of a clip from a certain trans YouTuber whomst I stan.",
        "link": "https://www.youtube.com/embed/YXJ-HwAmfi4?si=u88AwyKIGETWtRsz",
		"Commentary": "Around this time I was just realizing that I was maybe, possibly a little transgendered and I was really getting into the transfemme, Breadtube, video essayist, Natalie Wynn better known as “ContraPoints”. And I decided to take a clip from her most recent video at the time, “The Hunger” (which you should like totally go watch btw) and animated it because I thought it was funny."
      },
      {
        "Name": "(SFM) Transbian Moment",
        "Creation Date": "November 25th 2022",
        "Description": "A little animation of some musings I had that week",
        "link": "https://www.youtube.com/embed/kBJij041l4E?si=GNMzFIAUJwfBkXyt",
		"Commentary": "When I made this, I had just come out as a trans woman to my mom about 3 days prior and my to my dad the day before and I had just met this one girl who went to my school who I kinda sorta had a crush on. I remember I had showed up to school that day a bit early to bring in Jollof rice for our robotics Thanksgiving potluck (I’m not Nigerian or anything, I’m just black and really like Jollof rice because it’s delicious and my mom makes it well). Anyways I had about an hour before school started so I just wandered around for a bit until I found a guy from my team and some of his friends watching the Qatar World Cup. I decided to watch with them and in turn I met that girl. She called me pretty which I ate up because I was a little early transition rube who would fall in with anyone who called me pretty. That night I recorded a voiceover and over the next few days made an animation based on the encounter. Honestly, she never brought up the animation so I guess she had no clue it was about her. Anyways nothing came of it, she was bi but she had a boyfriend, who lived in like denmark, or some European country I can’t remember. Anyways I hope she’s doing well. She probably is, she was in IB and on like 15 different academic teams."
      },
      {
        "Name": "Highly Debatable: Episode 560, World War I, US Isolationism",
        "Creation Date": "December 12th 2022",
        "Description": "Podcast I made for my history final(also might be an allegory for my transition)",
        "link": "https://www.youtube.com/embed/QlVuo_sXMfA?si=2A4suoA5bbeolSDj",
		"Commentary": "Okay this was a fun one, this one was made for my fall final in Honors US History in 11th grade. We were given the task to make a podcast about US interventionism in World War I. I immediately had the idea of making it more than just a podcast explaining some boring history shit. At this time I was watching a lot of ContraPoints and specifically drew a lot of inspiration from the “Tiffany Tumbles” and “The Hunger” videos in how there was a lot of satire but also some real humanity in the characters. I also drew a lot from Grand Theft Auto. Specifically the GTA IV talk radio show, “Pacemaker” on Public Liberty Radio in how it creates a delightfully chaotic situation with the characters. I decided to connect the topic of US interventionism to the fictitious situation of these characters being locked in their underground podcast studio. <br><br> I had the choice of doing it in a group or on my own but I chose to do it on my own because I felt like most people wouldn’t understand why I’d wanna put so much effort into a school project. I also just didn’t think most people would have shared my vision because personally for me the project was also a metaphor for my transness. As I had just come out about a week or two prior. Replace “leaving the bunker” with leaving the bunker with “leaving the closet”. With Ada killing Xavier being a metaphor for me “killing” my past self through my transition. I had to let my previous self go and take that scary step out of the bunker to live a fulfilling life just like Ada. It was a deeply personal project for me Also Ada was the name I was going by at the time and Xavier was my deadname (I already regret putting this on the internet) so that only added to the super weirdness of the whole thing. There was no deep meaning to Michael’s name, I just like the name Michael for some reason. It’s a good default name for when I can’t think of anything else. <br><br>I did all the voice acting for the characters, writing, editing and mixing myself, everything but the music, which was like some public domain muzak song along with a Diskette Park song called “REFINED” that I slowed down a lot. I even made the sound of Ada axing the door open by hitting a piece of wood with a shovel, and then the sound effect for when she killed Xavier by hitting a pile of dirt with that shovel. If you couldn’t tell, I had a lot of fun with this one. And I had even more fun when it was played in class. It was getting pretty good laughs from everyone and they seemed to like the murder at the end because of course a room full of 11th graders liked violence. My teacher was at multiple times trying to turn it off but we had to beg him to let it play. If you were wondering about the grade I got on it, I got a 92(which is probably the highest grade I ever got in that class because that teacher was super annoyingly nitpicky) and the smug satisfaction that no one else in the class would come even close to what I did. "
      },
      {
        "Name": "(SFM) Miss Pauling Sends Heavy to the Queer Dimension",
        "Creation Date": "April 16th 2022",
        "Description": "An animation of a video of a different trans youtuber whomst I stan.",
        "link": "https://www.youtube.com/embed/w_hll8lvT_U?si=TrOVXQQX1q-HpYqB",
		"Commentary": "I mean there isn’t much of a story to this one, I got bored one April night and just felt like animating a video from another trans youtuber that I really like called Voice Quills. Fun little project. Also fun tidbit, but you might notice if you’re watching my videos sequentially that since my transition I use Miss Pauling in my animations a lot and that was not coincidence. I’ve grown to use her model as a default self insert because I just really identify with her character. Especially being one of the few women in a room full of men, yk. There’s this thing about her that I think any woman can identify with where it seems like she’s adapted to this overwhelmingly masculine environment without compromising her femininity. I think she’s cool and as such she’s become a character I kinda stan(I even when as her for halloween that year)"
      },
      {
        "Name": "Mayhem Pictures Logo",
        "Creation Date": "May 13th 2022",
        "Description": "Blender animation of a logo for my friend's film",
        "link": "https://www.youtube.com/embed/LC9bnvJBJIg?si=RihPhN_hm_DTcEk4",
		"Commentary": "I made this one for my friend Ameerah, she’s a film student and was making a horror film called, “Peripheral” (Which I starred in as the monster, and you should like totally watch because it’s actually pretty good, and I slayed my role, and it’s free on YouTube). She was in the last weeks of editing it and whatnot and she asked me to make a logo for her little production studio or whatever. So I made it, that’s the whole story. Nothing else, other than you should go check out the movie. Her channel is Mayhem Pictures on Youtube and I also played a role in some of her other movies. (Also to any USC admissions officers reading this, she’s applying to the School of Cinematic Arts too and you should accept her because she’s like a really professional filmmaker who does not fuck around with her craft. And I’m not just saying that because I’m her friend, like she is scary serious about this stuff. So yeah, you should accept her… and me of course, because I’m perfect and have no flaws whatsoever."
      },
      {
        "Name": "shutup.mp4",
        "Creation Date": "May 18th 2022",
        "Description": "Blender animation I made using an original character and environment I modeled",
        "link": "https://www.youtube.com/embed/UShIk-VaNcw?si=2ks3X6vg2Q6DO6Af",
		"Commentary": "This video on its face is pretty small but for me it stands as a pretty good mark for the evolution of my skills. If you’ve been watching all of my animations, you probably notice that I usually use pre-created models in my animation(e.g. Scout, Mudcrab, scout in a suit, Heavy, G-Man, Gordon Freeman, Alyx, Judith Mossman, and most infamously Miss Pauling) Usually these models were those that were bundled in from the start with Source Filmmaker. But this one stands alone as the very first animation on my channel using 100% original assets, even the background was made by me as I also modeled the room in the video as a set for my little person to be one. I finally figured out how to rig a model in blender and decided to use these new found skills to make joke insult animation. The model had actually been a project I had been working on for months. Learning modeling in Blender to finally create something usable. <br><br> Unfortunately since this was my very first venture in full body modeling in blender the model kinda sucks. The topology is weird and confusing, moving the hair alone is so unoptimized that my computer has crashed multiple times whilst doing it(In fact it got so bad that I just had to turn off the Hair in the viewport), and there’s a lot weirdness in how animation on it works. In short, it’s just not a really good model to actually use. But the silver lining is that 7 months later I reworked the model and it runs significantly better. I call her Xaragame 2.0. Hopefully I can make more animations with models like Xaragame 2.0."
		
      },
      {
        "Name": " BigBill.mp4 ",
        "Creation Date": "May 29th 2022",
        "Description": "Animation in Premiere, SFM, and Blender for my second history final",
        "link": "https://www.youtube.com/embed/_Zw7q8UKjG0?si=1lgoE55fpKiyH5hd",
		"Commentary": "Alright, we’re back with another history project. You know it’s kinda weird, I didn’t even particularly like my 11th grade history teacher all that much and yet for some reason I put remarkable effort into his finals. I really don’t know why, maybe it was to spite him. But he wasn’t even my least favorite teacher. He was just a little annoying, I really didn’t have strong feelings towards him and yet I cared more about his finals than any class I’ve ever had in regular school. Anyhow, enough of Xara Shaw’s therapy session, let’s get into this one. <br><br>This one was only a part of a larger project. He assigned us to make a presentation about a modern event and I decided to make it about the 2008 recession because I had the most satire for that specific topic. This too, was another project that I was not content with doing the bare minimum on. The original script ran for 15 minutes and had a lot of commentary on the subject of wealth inequality and the incompetence of the upper class. Along with background music and multiple videos where there was a 3D animation of me coming in explaining it. My goal was to make a Youtube video essay in the form of a High School history slideshow. Unfortunately My teacher revealed after I came up with those plans that he really wanted a presentation around 7 minutes long. So I unfortunately had to cut a hell of a lot of the presentation down. The three videos turned into one satirical sketch about buy here pay here dealerships borrowing notes from the “Big Bill Hell’s” fake car dealership ad from classic youtube. I did all the animation in Source Filmmaker in the span of a weekend. The project kinda got rushed at the end since I had to do so many cuts and rewrites to stay within his timeframe.<br><br>I even came up with a playlist of songs to play in the presentation as background music like a video essay. But unfortunately he didn’t have any speakers my phone could connect to so I couldn’t play it. If you’re wondering the playlist is as follows, <br><br><ol><li>Igor’s Theme(Instrumental) - Tyler, the Creator</li><li>Replaying the Game theme</li><li>Surfin USA - Beach Boys</li><li>An Old Bassman - Isamu Ohira</li><li>Bonus.wav - Esprit</li></ol><br><br>Regardless, I gave it my best effort, I memorized every single line in the shower the night before. Researched the hell out of the material, made sure I followed every bit of the rubric. And presented it to decent praise. It wasn’t as much of a hit as Highly Debatable, honestly, I felt like I could have done a bit better but it wasn’t bad(and honestly better than most of my classmates who read off of notecards and didn’t put nearly as much effort as I did)<br><br>Anyways, after all that effort, guess what grade I get. I got a B. A B!!!!. Like a low B too, like 80%. And look, if it was on the information or whatever, I’d get that, I’m not the biggest research genius or whatever. But it wasn’t that, in fact he gave me 100% on that. He gave me 100% on literally everything EXCEPT THE PRESENTATION. Which was the part I put the MOST effort into. I honestly have no clue what I did wrong. I memorized everything, I cited my sources and I spoke very enthusiastically. The one thing I can think of possibly messing up is that I didn’t look at the audience that much. I even asked him after just to know what the reasoning was. Like what could I possibly have done wrong. But he left me unanswered. So to this day I have no clue what I did. Worst of all, that was one of the big grades I had to move up to end the year with a 4.0 GPA. It still kinda haunts me not knowing, but I for the most part I’ve gotten over it. I mean hey, after all I still made something pretty cool here."
      },
      {
        "Name": "coffee.mp4",
        "Creation Date": "October 15 2023",
        "Description": "Blender animation I made using an original character and environment I modeled",
        "link": "https://www.youtube.com/embed/cwMXW8XCSdA?si=uWWKURZTZzwfIp8s",
		"Commentary": "Alright here we go with another Miss Pauling animation, and also the last video I made before submitting my college applications. This one uses audio sourced from a clip from ContraPoints’ video “Incels” . It's a really good video breaking down the whole weirdness of the movement and how it’s kind of a toxic death cult. I recommend you watch it. The clip in question is a moment where she’s recounting a weird encounter on a dating app. Overall it’s a pretty hilarious clip and is to this day probably my favorite moments of her’s. So since I was reminded of it due to another binge rewatch of ContraPoints videos since I was coming up on the 1 year anniversary of my transition, I decided to make it into a video. It took me about a weekend to make and I’m pretty satisfied with the work."
      }
    ],
    "Devlogs/Documentations":
    [
		{
        "Name": "Black Creek Avenue: A Complete Beginner’s Guide to Hammer Mapping",
        "Creation Date": "June 10th 2023",
        "Description": "A devlog for the creation of my Garry's Mod map, gm_black_creek_ave",
        "link": "https://docs.google.com/document/d/e/2PACX-1vS5JbV5ng_LWtro63ApAezrgp8zn9vD78vJb0fawK7GlvNSKv9i4e6t8qZHgfj84mjsrpMC9QYy2Pex/pub?embedded=true",
		"Commentary": ""
      },
      {
        "Name": "Basket Software Game Design Documentations",
        "Creation Date": "March 20th 2022",
        "Description": "Documentations I made for unfinished Roblox games in my failed Roblox studio",
        "link": "https://docs.google.com/document/d/e/2PACX-1vRCDl6L6-4GojeO_03j5IuidQBjBrYNzjHl3CqcTqCQyuNnxkMk5ZXrOJLP_PWKJsECLXyaywECBGVa/pub?embedded=true"
      },
      {
        "Name": "Basket Cinematica User Documentation",
        "Creation Date": "March 10th 2022",
        "Description": "Documentation of how to use the cutscene editor I made in roblox",
        "link": "https://docs.google.com/document/d/e/2PACX-1vQ1TgeJFwu_SX6EGgmIF-UOipvr3QzTobWPjD9xhlO87vqhdGr-72SsH5zSZ5xO2N_er1xjWen5Qw4j/pub?embedded=true"
      },
      {
        "Name": "Comic Destruction",
        "Creation Date": "May 10th 2023",
        "Description": "Concept for a game I was thinking about making for my game design club",
        "link": "https://docs.google.com/document/d/e/2PACX-1vTv3ic3uyLmXSvCtL_FF_TImUvPFXh81g3aQ43eiXl-Ae5wsZxKWHHk1OSRPeJz-6szeWw2qe6qj7Xr/pub?embedded=true"
      }
      
      
    ],
    "Scripts/Stories":
    [
      {
        "Name": "Anime Adventures Script",
        "Creation Date": "September 20th 2021",
        "Description": "Script I made for a Roblox Pokemon clone with Anime Characters, the project fell through due to feature creep",
        "link": "https://docs.google.com/document/d/e/2PACX-1vRferCyLwM8RrmUimyJ7QK4zbVn12OQLEKSahkxqk_1lfejltL5YH0et3AE5aTYVVb-SGvlp7STV1bq/pub?embedded=true",
		"Commentary": "Anime Adventures was a weird game and an even weirder project to work on. I joined when the game started development in July of 2021. Which in retrospect was very stupid, as I only started Roblox development in May of 2021. It sounds weird but that’s just the way Roblox is. Chronically online teenagers banding together to try and make it big in the neoliberal, gig economy hellscape of roblox.com.net.childlabor.  The concept of the game was essentially a Pokemon clone but with knockoffs of Anime Characters instead of monsters you had to capture. In theory it’s pretty simple and we probably could have been done with it in a month had we been managed well. But we were not managed well at all, the project was in development hell. I joined as a scripter originally, but then as time went on I became the game’s lead scripter, then script writer, then de facto manager of the project. If you can’t tell, I have a tendency to take on more work than I should when others aren’t doing it. Anyways, I could go on for days about the weirdness of this project. How I had to routinely correct my fellow scripters’ spaghetticode. Or how I wrote up a whole proposal for a grant from the roblox developer fund for the game. Or how I made a simple cutscene editor application, multiple different battle systems, the shop, the datastore, and much more. Or even just how weird the game testing was and how many hours I put into making things work.<br><br>Instead let’s talk about the story. The story wasn’t actually really conceptualized before the game started. The guy who ran the game only came up with the game, no story. Now I hadn’t originally intended to write the story. There was no plan on who would write the story, but I was assuming I wouldn’t, because I was once again, just a programmer. But as the game’s development went from July to October no story was forming and we needed to start. So I decided to help out in the conceptualization, intending to only get the ball rolling. But eventually I got so attached to the story that I just kinda kept writing and I became the story guy. Which was really weird because I was the only one on the team who didn’t watch any anime. Writing a story…for an anime game. As such you’ll find that there’s very little anime references in the story. Instead I focused on the ramifications of being able to “capture” people. As such I take advantage to write a story about the protagonist of the game living in a neocolonialist regime taking over a planet and capturing the native aliens of that planet. The game was supposed to show the main character gradually realize that the Aliens are sentient and don’t deserve the treatment. It was supposed to end in them killing their parents after their parents tried to kill the main character for supporting these aliens. After leaving home, the main character has to go up against the leader of this country in a revolution against the nation. Unfortunately, the game ended development in March 2022 and this story plan did not come to fruition. But at least we got 50 pages of a work in progress script.  <br><br>Few notes, the script wasn’t entirely written by me. A few of the side missions were written by my coworker and current friend lht2007, and only edited to make a little more sense by me. Also when I put the “developed by” tag on each part of the story, It was more so for project management to denote who was supposed to actually implement it in game with my cutscene editor. <br><br>Also each zone is basically a chunk of the story, think how Pokemon progresses with you going to different places as the game goes on. Also parts of the story under the “Main Story” header are parts that have to be watched when you enter and exit a new zone and are crucial to understanding the story. Parts under the “side fights” were fights that you just kinda wandered into as you went into the zone. They’re not crucial to the story, but provide nice worldbuilding and exploration. They were fights you did to earn xp to move on but you didn’t have to see all of them. Ones under the header, “Side character encounters” were missions that were just pure worldbuilding, completely random, and auxiliary to progression (think strangers and freaks missions from Grand Theft Auto). And Lastly, ones under the header, “PSPR PlanSoc Public Radio” Were dialogue that was supposed to be for an intended feature where when the player was exploring the world they could tune into a talk radio station and get a bunch of worldbuilding. (Think the talk radio stations from Grand Theft Auto like WCTR, PLR, and WKTT)"
      },
      {
        "Name": "Freedom of Consequences",
        "Creation Date": "November 10th 2021",
        "Description": "Short story I wrote after coming home one day",
        "link": "https://docs.google.com/document/d/e/2PACX-1vSumD8gO5edlcjRfFw2bI5V4J0I4iA4heUknHQDHUrs-qGgofFtSGXYJ2iwz8TzDkwtu23_880eAWO9/pub?embedded=true",
		"Commentary": "Should I even put this in my portfolio? Is this like cancelable? Will the woke mob come for me after this? Perchance, the radical left agenda of twitter.com.net.xxx will come for me. If you couldn’t tell, I'm very uncomfortable as much as I am in love with my own creation. Considering there are some questionable quotes from the text.<br><br> Anyways, this is definitely one of my weirder works. The idea of this came to me when I was riding my bike back home from school on a particularly windy evening. Mind you this was back when covid was still a thing and it was still common practice to wear masks, so I was also wearing a mask when riding my bike. Due to my exhaustion, I decided to take off the mask. Right as a Ford F-150 drove by. I don’t remember what it was about the truck, but something just made it stand out to me and it led me to come up with a weird story. One where this guy panders to a bunch of random ideologically opposed people as he rides home. <br><br> I’ll be real with y’all, I was a little annoying and cynical smart ass back then who thought he knew more than anyone else. I do still like this story, I think there's some good laughs in the short time I have. But I can’t quite separate it from my, 'I am smarter than everyone around me' phase. It’s just, a little bit cringe ya know?"
      },
      {
        "Name": "Dr Rassanadana Mental Health Hour",
        "Creation Date": "November 18th 2022",
        "Description": "Short story I wrote when I was bored and had a fever, and just finished realizing that I was trans",
        "link": "https://docs.google.com/document/d/e/2PACX-1vQBL34LeDfsG7Hhu5KwSyDtuGJ8L9kNWkkapCqggYyVh1CH8MOMt5KRk7FzeI2-Mm8tzx_VHENMlrz7/pub?embedded=true",
		"Commentary": "Ooh, I like this one a lot. It’s probably not the best thing I’ve ever made but it really feels like the work that officially marked the start of my transition. I wrote this in a day. The day after I decided I was trans and the day before I bought femme clothes for the first time and came out to my mom. I remember I had been watching a hell of a lot of ContraPoints, especially the “Tiffany Tumbles” and “The Hunger” videos and I got inspired to write my own thing. During this time I was feeling really cynical about Maury and Dr. Phil and all of those trash daytime talk shows that just exploit the “Weird” people of society for content for the “normals” to cringe at. <br><br> So, I decided to take the weirdest person you could come up with, a trans-lesbian cat girl named Tabitha, and try to make you sympathize with her. Then simultaneously make you hate the “normal”. But at the same time I also didn’t want you to completely hate the “normal” as rarely people’s singular actions aren’t the sole reason why bad shit happens. More often than not their actions are a feedback loop between their shitty, singular choices and other people’s shitty affirmations of those shitty choices. I’ve toyed with this idea a bit and have even thought about a game similar to Portal that explores these themes. With that being said, being a bad person is a game that can really only be played by at least three people. A person who causes pain, a person who validates the pain, and someone who has pain inflicted on them. Dr Rassanadana Causes the pain, the audience validates it, and Tabitha is left mocked on syndicated daytime television. <br><br> I knew from the get that I wanted this story to have…not a downer ending, but an imperfect one. One that isn’t very satisfying but also isn’t hopeless. It’s a downer ending for Dr. Rassanadana because she’s stuck in this shitty life she doesn’t want where she makes fun of the less fortunate to satiate her addiction for attention. She is living in a prison of her own addiction to attention and will likely rot there. But it’s a fairly positive ending for Tabitha because to be honest I don’t think Tabitha was really meant to be a particularly tragic character like Dr. Rassanadana. I mean overall she comes to the show composed and fully aware of Dr. Rassanadana’s shtick. Only dancing with the devil to make one last attempt at salvaging her relationship with her mother. And at the end of the day, she gets what she came for. <br><br> Now honestly, I think the ending for Tabitha was a little bit on the meh side of things and that’s honestly for a few reasons. One, this was really only meant to be a day long project and I had just taken nighttime cough medicine for the cold I had that week. So by the end I did kinda rush it a bit so I could go to bed. Two, I didn’t want a tragic gay ending, so much of queer media is just pure downer endings where we don’t get to see these people happy and I’m honestly sick of it. It needs to go. But three, I don’t really feel Tabitha was the protagonist of the story, it was Dr. Rassanadana who was the protagonist. An anti hero to an anti villain. I felt like getting in her head was more interesting so I centered more of the plot around her and gave her the better, albeit sadder ending."
      },
      {
        "Name": "Seven Sentences",
        "Creation Date": "Februrary 4th 2022",
        "Description": "A weird story satirizing school",
        "link": "https://docs.google.com/document/d/e/2PACX-1vSZoJh6EpfEP6kWww88ORVhM5e9cVzuxe_TVnHwcBuV-r42Chyk6EEXxAS5qHmH0oXENATpLjvMWSE8/pub?embedded=true",
		"Commentary": "Another one from my cynical dumbass era that I kinda like. I had this English teacher I had…mixed feelings about. And every day he assigned this warm up where we had to write like 10 sentences on something I often didn’t know or care about. I’m sure he had good intentions but man I just had none of it at 8:30 in the morning. As such I decided to deal with the only way I knew how. Creatively bitching and whining. So you know I made a satire of the real emotions I often had when I worked on his warm ups. It’s not really super deep I just thought it was funny."
      }
      
    ],
	"Essays":
    [
      {
        "Name": "How a TV AD Changed my Life",
        "Creation Date": "Feburary 12th 2023",
        "Description": "Essay I made about advertisements and trans identity",
        "link": "https://docs.google.com/document/d/e/2PACX-1vR_cpFUJtDOt8Xw9EuepEmb1E-3Iv5Pyqqj-n0q1uLV9sxFbAOo3_fUb-focbzTnuf_zx9omfbqMZjP/pub?embedded=true"
      },
      {
        "Name": "Legos",
        "Creation Date": "April 21th 2023",
        "Description": "Essay I made about life in the closet and Legos",
        "link": "https://docs.google.com/document/d/e/2PACX-1vRk7te5Vfe2llT8Iq_C9JoD93abS97Tzfo6hG7xLo8Zb7ZuOCPVZ092vDlJNg9GUd0-aEaeiil6bz2F/pub?embedded=true"
      }
      
    ],
	"Roblox":
    [
      {
        "Name": "ralphJob",
        "Creation Date": "Feburary 12th 2023",
        "Platform": "Roblox",
        "Description": "My job was to create a first person movement system, and I created a first person movement system. It was made for a commission for the currently unreleased Roblox game, “Bark”. Idk, I like this work as it’s the only one that’ll probably end up in an actual game. But at the same time it’s kinda simple. It comes packed with a crouch (hold c or or right thumbstick), Sprint (shift or left thumbstick), slide (shift + c or left thumbstick + right thumbstick), jumping (Space or A). Also comes with console and mobile support. The system uses renderstepped to update the orientation of the player based on the camera direction on every frame rendered. I also use renderstepped to do head bobbing effect by making a procedural camera bobbing animation. The sprint, jump, and crouch abilities on the other hand are functions that lower the camera and change the run speed and FOV.",
		"Preview-Type": "googleDrive",
        "link": "https://docs.google.com/document/d/e/2PACX-1vR_cpFUJtDOt8Xw9EuepEmb1E-3Iv5Pyqqj-n0q1uLV9sxFbAOo3_fUb-focbzTnuf_zx9omfbqMZjP/pub?embedded=true"
      }
      
      
    ],
    "Mods":
    [
      
      
    ],
    "models":
    [
      
      
    ],
	"Highlights":
	[
		{
			"Name": "Battle of the Heart",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioGames.html?mediaType=Browser-Games&dataIndex=0",
			"Image": "data/images/both.png"
		},
		{
			"Name": "Better Kill Saul",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioGames.html?mediaType=Demos&dataIndex=0",
			"Image": "data/images/bks.png"
		},
		{
			"Name": "gm_black_creek_ave",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioGamesNonBrowser.html?mediaType=Maps&dataIndex=0",
			"Image": "data/images/bca.jpg"
		},
		{
			"Name": "coffee.mp4",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioVideo.html?mediaType=Videos&dataIndex=11",
			"Image": "data/images/cm.png"
		},
		{
			"Name": "Dr. Rassanadana Mental Health Hour",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioWriting.html?mediaType=Scripts/Stories&dataIndex=2",
			"Image": ""
		},
		{
			"Name": "Anime Adventures Script",
			"Link": "https://xaragameishere.github.io/Pages/PortfolioWriting.html?mediaType=Scripts/Stories&dataIndex=0",
			"Image": "data/images/aas.png"
		}
	]
  }
  